Repository: manespcar/8belts_test
Catalog: lib/l10n/arb/app_*.arb
Languages: es

# homePageStep1
source: Step 1
es: Paso 1

# homePageStep2
source: Step 2
es: Paso 2

# homePageStep3
source: Step 3
es: Paso 3

# homePageStep4
source: Step 4
es: Paso 4

# homePageStep5
source: Step 5
es: Paso 5

# homePageStep1Text
source: Thanks to this application you will be able to send instructions to our tracking rover located on the planet Mars.
es: Gracias a esta aplicación podrás enviarle instrucciones a nuestra nave rastreadora situada en el planeta Marte.

# homePageStep2Text
source: Because communication is complicated and the planet is strange, with possible obstacles on the ground, the tracker rover will always start from the center position.
es: Debido a que la comunicación es complicada y el planeta es extraño, con posibles obstáculos sobre el terreno, la nave rastreadora siempre empezará desde la posición central.

# homePageStep3Text
source: The allowed movements will be: forward (F), left (L) and right (R), with a maximum of nine movements.
es: Los movimientos permitidos serán: adelante(F), izquierda(L) y derecha(R), con un máximo de nueve movimientos.

# homePageStep4Text
source: If the rover encounters any obstacles, it will move to the back space and the process will be aborted.
es: Si la nave se encuentra algún obstáculo, se moverá a la siguiente casilla anterior y se cancelará el proceso.

# homePageStep5Text
source: Instructions
es: Instrucciones

# homePageStep5TextButton
source: Send
es: Enviar

# homePageInstructionError
source: The instruction is not valid
es: La instrucción no es válida

# marsFloorPageScanningFloor
source: Scanning the floor...
es: Escaneando el terreno...

# marsFloorPageStartButton
source: Start
es: Comenzar

# marsFloorPageBackButton
source: Back
es: Volver

# marsFloorPageAbortedText
source: Mission aborted, the rover found an obstacle in the position {0}
es: Misión abortada, la nave encontró un obstáculo en la posición {0}

# marsFloorPageSuccessText
source: Mission completed, the rover has completed his route
es: Misión completada, la nave ha completado su recorrido

# marsFloorPageOutOfLimitsText
source: Out of limits! The rover cannot continue
es: Fuera de los límites! La nave no puede continuar

# notFoundPageTitle
source: Not found
es: Página no encontrada

# notValidInstructionPageTitle
source: Not valid instruction
es: Instrucción no válida

# notValidInstructionPageSubTitle
source: The instruction must contain only F, L or R with a maximum length of nine characters
es: La instrucción debe de contener solo F, L o R con una longitud máxima de nueve caracteres
